Revit 2027 API
IViewSheetSet.Views Property
The views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
ViewSet Views { get; set; }
Property Views As ViewSet
	Get
	Set
property ViewSet^ Views {
	ViewSet^ get ();
	void set (ViewSet^ value);
}
abstract Views : ViewSet with get, set
Property Value
ViewSet
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input views is null.
InvalidOperationException |  Thrown when the set operation failed due to invalid view which cannot be printed.
See Also
Reference
IViewSheetSet Interface
Autodesk.Revit.DB Namespace